.MODEL small
.STACK 100h

.DATA
    ; Буфер для вводу даних
    ; Перший байт визначає максимальний розмір буфера
    ; Другий байт буде використовуватися для збереження фактичної довжини введеного рядка
    ; Решта байтів - самі введені дані
    inputBuffer DB 255, ?, 255 dup(0)  ; Максимальний розмір 255 байтів

.CODE
MAIN PROC
    ; Ініціалізація сегменту даних
    mov ax, @data
    mov ds, ax

    ; Встановлення функції переривання 21h для читання рядка з клавіатури
    mov ah, 0Ah     ; Функція читання рядка
    lea dx, inputBuffer ; Вказівник на буфер вводу
    int 21h         ; Виклик DOS-переривання

    ; Для демонстрації: Вивід введеного рядка назад на екран
    ; Встановлення функції переривання 21h для виводу рядка на екран
    mov ah, 09h
    lea dx, inputBuffer + 2 ; Пропускаємо перші два байти буфера
    int 21h         ; Виклик DOS-переривання

    ; Завершення програми і повернення в DOS
    mov ax, 4C00h
    int 21h
MAIN ENDP
END MAIN